<?php

return [

    /*
    |--------------------------------------------------------------------------
    | URL DE MOODLE
    |--------------------------------------------------------------------------
    */

    'url' => env(
        'MOODLE_URL',
        'https://cv.utm.mx'
    ),


    /*
    |--------------------------------------------------------------------------
    | SERVICIO WEB
    |--------------------------------------------------------------------------
    */

    'service' => env(
        'MOODLE_SERVICE',
        'moodle_mobile_app'
    ),


    /*
    |--------------------------------------------------------------------------
    | ROLES AUTORIZADOS
    |--------------------------------------------------------------------------
    |
    | Moodle normalmente utiliza:
    |
    | editingteacher = Profesor con permisos de edición
    | teacher        = Profesor
    |
    */

    'teacher_roles' => [

        'editingteacher',

        'teacher',

    ],


    /*
    |--------------------------------------------------------------------------
    | VERIFICACIÓN SSL
    |--------------------------------------------------------------------------
    */

    'verify_ssl' => filter_var(
        env('MOODLE_VERIFY_SSL', true),
        FILTER_VALIDATE_BOOLEAN
    ),

];